[{"HadithNumber":1,"ArabicText":"عَنْ أَمِيرِ المُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ ﷺ يَقُولُ: إنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ","EnglishText":"On the authority of the Commander of the Faithful, Abu Hafs 'Umar bin al-Khattab (may Allah be pleased with him), who said: I heard the Messenger of Allah (ﷺ) say: \"Actions are (judged) by intentions, so each man will have what he intended. Thus, he whose emigration was to Allah and His Messenger, his emigration is to Allah and His Messenger; but he whose emigration was for some worldly thing he might gain, or for a woman he might marry, his emigration is to that for which he emigrated.\"","BookNumber":1,"BookName":"40 Hadith Nawawi","BookArabicName":"الأربعون النووية","Grade":"Sahih","Reference":"nawawi40:1","InBookReference":"1:1"},{"HadithNumber":2,"ArabicText":"عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ أَيْضاً قَالَ: بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ ﷺ ذَاتَ يَوْمٍ إذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ شَدِيدُ سَوَادِ الشَّعَرِ","EnglishText":"Also on the authority of 'Umar (may Allah be pleased with him), who said: While we were one day sitting with the Messenger of Allah (ﷺ), there appeared before us a man dressed in extremely white clothes and with very black hair. He sat down close by the Prophet (ﷺ), rested his knees against his knees, and said, 'O Muhammad, tell me about Islam.'","BookNumber":1,"BookName":"40 Hadith Nawawi","BookArabicName":"الأربعون النووية","Grade":"Sahih","Reference":"nawawi40:2","InBookReference":"1:2"},{"HadithNumber":3,"ArabicText":"عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الخَطَّابِ رَضِيَ اللهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اللَّهِ ﷺ يَقُولُ: بُنِيَ الإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّداً رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ","EnglishText":"On the authority of Abdullah, the son of 'Umar ibn al-Khattab (may Allah be pleased with them both), who said: I heard the Messenger of Allah (ﷺ) say: \"Islam has been built on five [pillars]: testifying that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, establishing the salah (prayer), paying the zakat (obligatory charity), making the hajj (pilgrimage) to the House, and fasting in Ramadan.\"","BookNumber":1,"BookName":"40 Hadith Nawawi","BookArabicName":"الأربعون النووية","Grade":"Sahih","Reference":"nawawi40:3","InBookReference":"1:3"}]