[{"HadithNumber":1,"ArabicText":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ اللَّهُ تَعَالَى: أَنَا أَغْنَى الشُّرَكَاءِ عَنِ الشِّرْكِ، مَنْ عَمِلَ عَمَلاً أَشْرَكَ فِيهِ مَعِي غَيْرِي تَرَكْتُهُ وَشِرْكَهُ","EnglishText":"On the authority of Abu Hurayra (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said: Allah (mighty and sublime be He) said: I am so self-sufficient that I am in no need of having an associate. Thus he who does an action for someone else's sake as well as Mine will have that action renounced by Me to him whom he associated with Me.","BookNumber":1,"BookName":"40 Hadith Qudsi","BookArabicName":"الأحاديث القدسية","Grade":"Sahih","Reference":"qudsi40:1","InBookReference":"1:1"},{"HadithNumber":2,"ArabicText":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَقُولُ اللَّهُ تَعَالَى: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي، وَأَنَا مَعَهُ إذَا ذَكَرَنِي","EnglishText":"On the authority of Abu Hurayra (may Allah be pleased with him), who said that the Prophet (ﷺ) said: Allah the Almighty said: I am as My servant thinks I am. I am with him when he makes mention of Me. If he makes mention of Me to himself, I make mention of him to Myself; and if he makes mention of Me in an assembly, I make mention of him in an assembly better than it.","BookNumber":1,"BookName":"40 Hadith Qudsi","BookArabicName":"الأحاديث القدسية","Grade":"Sahih","Reference":"qudsi40:2","InBookReference":"1:2"},{"HadithNumber":3,"ArabicText":"عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: قَالَ اللَّهُ تَعَالَى: إذَا تَقَرَّبَ عَبْدِي مِنِّي شِبْراً تَقَرَّبْتُ مِنْهُ ذِرَاعاً","EnglishText":"On the authority of Anas (may Allah be pleased with him), who said: I heard the Messenger of Allah (ﷺ) say: Allah the Almighty said: O son of Adam, so long as you call upon Me and ask of Me, I shall forgive you for what you have done, and I shall not mind.","BookNumber":1,"BookName":"40 Hadith Qudsi","BookArabicName":"الأحاديث القدسية","Grade":"Sahih","Reference":"qudsi40:3","InBookReference":"1:3"}]